; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared2 - mode
	spectrograph1 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	GroundStation13 - direction
	Star8 - direction
	GroundStation12 - direction
	Star5 - direction
	Star11 - direction
	GroundStation9 - direction
	GroundStation4 - direction
	GroundStation10 - direction
	Star7 - direction
	GroundStation1 - direction
	GroundStation14 - direction
	GroundStation3 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Planet20 - direction
	Phenomenon21 - direction
	Planet22 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation14)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 Star5)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet22)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 infrared2)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation14)
	(calibration_target instrument4 Star7)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 GroundStation14)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation14)
)
(:goal (and
	(pointing satellite1 GroundStation6)
	(have_image Planet15 spectrograph1)
	(have_image Planet16 spectrograph1)
	(have_image Star17 spectrograph1)
	(have_image Star18 infrared0)
	(have_image Phenomenon19 spectrograph1)
	(have_image Planet20 infrared2)
	(have_image Phenomenon21 spectrograph1)
	(have_image Planet22 infrared0)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 9
2. (calibrate satellite1 instrument4 groundstation14)
   added: (calibrated instrument4)
   goals met: 0 of 9
3. (turn_to satellite1 groundstation6 groundstation14)
   deleted: (pointing satellite1 groundstation14)
   added: (pointing satellite1 groundstation6)
   goals met: 1 of 9
4. (turn_to satellite1 phenomenon19 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon19)
   goals met: 0 of 9
5. (take_image satellite1 phenomenon19 instrument4 spectrograph1)
   added: (have_image phenomenon19 spectrograph1)
   goals met: 1 of 9
6. (turn_to satellite1 groundstation6 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 groundstation6)
   goals met: 2 of 9
7. (turn_to satellite1 phenomenon21 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon21)
   goals met: 1 of 9
8. (take_image satellite1 phenomenon21 instrument4 spectrograph1)
   added: (have_image phenomenon21 spectrograph1)
   goals met: 2 of 9
9. (turn_to satellite1 groundstation6 phenomenon21)
   deleted: (pointing satellite1 phenomenon21)
   added: (pointing satellite1 groundstation6)
   goals met: 3 of 9
10. (turn_to satellite1 planet15 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet15)
   goals met: 2 of 9
11. (take_image satellite1 planet15 instrument4 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 3 of 9
12. (turn_to satellite1 groundstation6 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 groundstation6)
   goals met: 4 of 9
13. (turn_to satellite1 planet16 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet16)
   goals met: 3 of 9
14. (take_image satellite1 planet16 instrument4 spectrograph1)
   added: (have_image planet16 spectrograph1)
   goals met: 4 of 9
15. (turn_to satellite1 groundstation6 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 groundstation6)
   goals met: 5 of 9
16. (turn_to satellite1 planet20 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet20)
   goals met: 4 of 9
17. (take_image satellite1 planet20 instrument4 infrared2)
   added: (have_image planet20 infrared2)
   goals met: 5 of 9
18. (turn_to satellite1 groundstation6 planet20)
   deleted: (pointing satellite1 planet20)
   added: (pointing satellite1 groundstation6)
   goals met: 6 of 9
19. (turn_to satellite1 planet22 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet22)
   goals met: 5 of 9
20. (take_image satellite1 planet22 instrument4 infrared0)
   added: (have_image planet22 infrared0)
   goals met: 6 of 9
21. (turn_to satellite1 groundstation6 planet22)
   deleted: (pointing satellite1 planet22)
   added: (pointing satellite1 groundstation6)
   goals met: 7 of 9
22. (turn_to satellite1 star17 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 star17)
   goals met: 6 of 9
23. (take_image satellite1 star17 instrument4 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 7 of 9
24. (turn_to satellite1 groundstation6 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 groundstation6)
   goals met: 8 of 9
25. (turn_to satellite1 star18 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 star18)
   goals met: 7 of 9
26. (take_image satellite1 star18 instrument4 infrared0)
   added: (have_image star18 infrared0)
   goals met: 8 of 9
27. (turn_to satellite1 groundstation6 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 groundstation6)
   goals met: 9 of 9
